# Brewfile for YouTube AI Education Content Creation

# Core Development Tools
brew "git"
brew "python@3.11"
brew "uv"
brew "node"
brew "wget"
brew "curl"

# Video Production Essentials
cask "obs"
cask "audacity"
cask "handbrake"
cask "rectangle"  # Window management

# Audio Tools
cask "blackhole-2ch"  # Virtual audio driver
cask "loopback"  # Advanced audio routing

# Development Environment
cask "visual-studio-code"
cask "ghostty"
cask "github"  # GitHub Desktop

# AI/ML Tools
cask "ollama"
cask "lm-studio"  # GUI for local LLMs

# Browsers & Productivity
cask "ungoogled-chromium"
cask "zen"
cask "obsidian"
cask "betterdisplay"
cask "bitwarden"  # Password manager

# Security & Utilities
brew "bitwarden-cli"  # Password manager CLI

# Screen Recording Helpers
cask "keycastr"  # Show keyboard shortcuts on screen
cask "camo-studio"  # Use iPhone as webcam
