# Brewfile for YouTube AI Education Content Creation

# Taps
tap "homebrew/bundle"
tap "homebrew/cask"

# Core Development Tools
brew "git"
brew "python@3.11"
brew "node"
brew "wget"
brew "curl"

# Video Production Essentials
cask "obs"
cask "audacity"
cask "handbrake"
cask "rectangle"  # Window management

# Audio Tools
cask "blackhole-2ch"  # Virtual audio driver
cask "loopback"  # Advanced audio routing

# Development Environment
cask "visual-studio-code"
cask "ghostty"
cask "github"  # GitHub Desktop

# AI/ML Tools
cask "ollama"
cask "lm-studio"  # GUI for local LLMs
brew "miniconda"

# Browsers & Productivity
cask "chromium"
cask "obsidian"
cask "betterdisplay"

# Screen Recording Helpers
cask "keycastr"  # Show keyboard shortcuts on screen
cask "camo"  # Use iPhone as webcam
